Revit 2027 API
DirectShapeType.AddReferencePlane Method
Overload List
Name | Description
AddReferencePlane(Plane) |  Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV) |  Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, DirectShapeReferenceOptions) |  Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
AddReferencePlane(Plane, BoundingBoxUV, DirectShapeReferenceOptions) |  Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
Top
See Also
Reference
DirectShapeType Class
Autodesk.Revit.DB Namespace